UI/price_scout/app/controllers/listings_controller.rb

INSERT INTO "listings" ("updated_at", "title", "price", "request_id", "url", "created_at") VALUES('2009-02-03 03:53:14', NULL, NULL, NULL, NULL, '2009-02-03 03:53:14')
---
  def create
    @listing = Listing.new(params[:listing])

    respond_to do |format|
      if @listing.save