UI/price_scout/app/controllers/requests_controller.rb

SELECT * FROM "requests" WHERE ("requests"."id" = 1)
---
  def show
    @request = Request.find(params[:id])

SELECT * FROM "requests" WHERE ("requests"."id" = 2)
---
  def edit
    @request = Request.find(params[:id])

INSERT INTO "requests" ("updated_at", "price", "done", "max", "date_found", "user_id", "query", "date_initiated", "created_at") VALUES('2009-02-03 03:44:11', NULL, 'f', NULL, '2009-02-03 03:44:00', 0, '', '2009-02-03 03:44:00', '2009-02-03 03:44:11')
---


    respond_to do |format|
      if @request.save

SELECT * FROM "requests" WHERE ("requests"."id" = 4)
UPDATE "requests" SET "done" = 'f', "date_found" = '2009-02-10 03:49:00', "date_initiated" = '2009-02-10 03:49:00', "updated_at" = '2009-02-10 03:49:34' WHERE "id" = 4
---
  def update
    @request = Request.find(params[:id])

    respond_to do |format|
      if @request.update_attributes(params[:request])

SELECT * FROM "requests" WHERE ("requests"."id" = 1)
DELETE FROM "requests" WHERE "id" = 1
---
  def destroy
    @request = Request.find(params[:id])
    @request.destroy