UI/price_scout/app/controllers/users_controller.rb

  def index
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('40f62a36f78ad252f1b25f4333430e3898ab86b8', '2009-02-10 03:33:58', '133ac8aa7e11721262bae183bab56a2678467ed6', NULL, NULL, 'testing', 'test@test.com', '2009-02-10 03:33:58')